/*
  Напиши цикл, который просит, через prompt, ввести число больше 100.
  
  Если посетитель нажал Cancel - завершить цикл.
  
  Если посетитель ввёл другое число – попросить ввести ещё раз,
  и так далее, пока не введет число больше 100.
  
  Предполагается, что посетитель вводит только числа,
  обрабатывать невалидный ввод вроде строк 'qwerty' не нужно.
  
  PS: используй бесконечный цикл с прерыванием
*/
do {
  userInput = prompt('Введите число больше 100');
  const num = Number.parseInt(userInput);
  
  if (userInput == null){
    break;
  } else if (num <= 100) {
    alert("Нужно ввести чисо больше 100!");
  } else  {
    alert("Спасибо!");
  }
} while (userInput <= 100);


